PiAsHomeMediaCenter.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-11-25 六 09:48 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>使用树莓派定制智能电视系统</title>
<meta name="author" content="ChanMo" />
<meta name="description" content="使用树莓派定制家庭影音中心" />
<meta name="keywords" content="raspberry, kodi, jellyfin" />
<meta name="generator" content="Org Mode" />
<link rel='stylesheet' href='bulma.min.css'><link rel='stylesheet' href='app.css'>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="/blog"> HOME </a>
</div><div id="preamble" class="status">
<nav class='navbar is-dark is-fixed-top'><div class='container' style='max-width:768px;padding:0 1.5rem;'><div class='navbar-brand'><a href='/' class='navbar-item'>CHANMO</a><a role='button' class='navbar-burger' aria-label='menu' aria-expanded='false' data-target='main-nav'><span aria-hidden='true'></span><span aria-hidden='true'></span><span aria-hidden='true'></span></a></div><div id='main-nav' class='navbar-menu'><div class='navbar-end'><a href='https://github.com/ChanMo' class='navbar-item' target='_blank'>Github</a><a href='./about.html' class='navbar-item'>About</a><div class='navbar-item'><input type='checkbox' class='is-hidden' id='toggle' /><label for='toggle'></label></div></div></div></div></nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">使用树莓派定制智能电视系统</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org9bfa66b">1. 2022/04/16</a></li>
<li><a href="#orge7dd17d">2. KODI</a>
<ul>
<li><a href="#org6edfce7">2.1. Install</a></li>
<li><a href="#org75e050c">2.2. 修复中文字符无法显示</a></li>
<li><a href="#orgd53e191">2.3. 开机启动</a></li>
</ul>
</li>
<li><a href="#orgf35fcc8">3. Jellyfin</a>
<ul>
<li><a href="#org5a662e3">3.1. Install</a></li>
</ul>
</li>
</ul>
</div>
</nav>

<div id="outline-container-org9bfa66b" class="outline-2">
<h2 id="org9bfa66b"><span class="section-number-2">1.</span> 2022/04/16</h2>
<div class="outline-text-2" id="text-1">
<p>
Pi3B播放H264没问题, H265会卡顿, 只有音频, 无视频
Pi4B可正常播放H264, H265
</p>
</div>
</div>

<div id="outline-container-orge7dd17d" class="outline-2">
<h2 id="orge7dd17d"><span class="section-number-2">2.</span> KODI</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org6edfce7" class="outline-3">
<h3 id="org6edfce7"><span class="section-number-3">2.1.</span> Install</h3>
<div class="outline-text-3" id="text-2-1">
<pre class="example">
$ sudo apt install kodi
</pre>
</div>
</div>


<div id="outline-container-org75e050c" class="outline-3">
<h3 id="org75e050c"><span class="section-number-3">2.2.</span> 修复中文字符无法显示</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Goto Kodi home screen
Select menu: System | Interface settings
Select: Skin
Select: Fonts
Select: Arial based
</p>
</div>
</div>

<div id="outline-container-orgd53e191" class="outline-3">
<h3 id="orgd53e191"><span class="section-number-3">2.3.</span> 开机启动</h3>
<div class="outline-text-3" id="text-2-3">
<pre class="example">
$ sudo sed -i "1i @kodi" /etc/xdg/lxsession/LXDE-pi/autostart
</pre>
</div>
</div>
</div>


<div id="outline-container-orgf35fcc8" class="outline-2">
<h2 id="orgf35fcc8"><span class="section-number-2">3.</span> Jellyfin</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org5a662e3" class="outline-3">
<h3 id="org5a662e3"><span class="section-number-3">3.1.</span> Install</h3>
<div class="outline-text-3" id="text-3-1">
<pre class="example">
$ sudo apt install apt-transport-https
$ curl https://repo.jellyfin.org/debian/jellyfin_team.gpg.key | gpg --dearmor | sudo tee /usr/share/keyrings/jellyfin-archive-keyring.gpg &gt;/dev/null
$ echo "deb [signed-by=/usr/share/keyrings/jellyfin-archive-keyring.gpg arch=$( dpkg --print-architecture )] https://repo.jellyfin.org/debian $( lsb_release -c -s ) main" | sudo tee /etc/apt/sources.list.d/jellyfin.list
$ sudo apt update
$ sudo apt install jellyfin
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<script src='app.js'></script>
</div>
</body>
</html>